/*
//Домашнее задание, Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньше
Console.Write("Input first number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
double b = Convert.ToInt32(Console.ReadLine());

if(a > b)
{
    Console.WriteLine("Max");
}
else
{
    Console.WriteLine("Min");
}
*/
/*

// Задача 4.Написать прогрпмму, которая принимает на вход три числа и выдает максимальное
Console.Write("Input a first number ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a thrd number ");
int c = Convert.ToInt32(Console.ReadLine());
int max = a;
if (b > max)
{
    max = b;
}
if (c > max)
{
    max = b;
}
Console.WriteLine($"max number is {max}");
*/
/*
//Задача 6.Написать программу,которая на вход принимает число и выдает,яыляется лио но четным

Console.Write("Input a number ");
int a = Convert.ToInt32(Console.ReadLine());
if (a % 2 == 0)
{
    Console.WriteLine($"{a} is an even number");
} 
else 
{
    Console.WriteLine($"{a} is an odd number");
}
*/
/*
// Задача 8. Написать программу, которая на вход принимает число (N), а на выходе показывает все четные числа от 1 дл N.
Console.Write("Input a number ");
int A = Convert.ToInt32(Console.ReadLine());
int T = 0;

while (T + 1 < A)
{
    T = T + 2;
    Console.WriteLine($"{T}");
}
*/