/*
//Домашнее задание, Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньше
Console.Write("Input first number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
double b = Convert.ToInt32(Console.ReadLine());

if(a > b)
{
    Console.WriteLine("Max");
}
else
{
    Console.WriteLine("Min");
}
*/
/*

// Задача 4.Написать прогрпмму, которая принимает на вход три числа и выдает максимальное
Console.Write("Input a first number ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a thrd number ");
int c = Convert.ToInt32(Console.ReadLine());
int max = a;
if (b > max)
{
    max = b;
}
if (c > max)
{
    max = b;
}
Console.WriteLine($"max number is {max}");
*/