/*
//Домашнее задание, Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньше
Console.Write("Input first number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
double b = Convert.ToInt32(Console.ReadLine());

if(a > b)
{
    Console.WriteLine("Max");
}
else
{
    Console.WriteLine("Min");
}
*/